<abi-corpus version='2.1' path='test.o' architecture='elf-amd-x86_64'>
  <elf-variable-symbols>
    <elf-symbol name='a' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='b' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='test.cc' language='LANG_C_plus_plus_14'>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='A' size-in-bits='64' is-struct='yes' visibility='default' id='3ed987a4'>
      <member-type access='public'>
        <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='a' type-id='95e97e5e' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='4'>
            <var-decl name='b' type-id='95e97e5e' visibility='default'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='8'>
            <var-decl name='c' type-id='95e97e5e' visibility='default'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='b' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='c' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='d' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='e' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='B' size-in-bits='32' is-struct='yes' visibility='default' id='41d98c5d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='b' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <var-decl name='a' type-id='3ed987a4' mangled-name='a' visibility='default' elf-symbol-id='a'/>
    <var-decl name='b' type-id='41d98c5d' mangled-name='b' visibility='default' elf-symbol-id='b'/>
  </abi-instr>
</abi-corpus>
